/*1. Задать температуру в градусах по Цельсию.Вывести в alert соответствующую температуру в градусах по Фаренгейту.
Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию*/

let celsiusTerm = prompt("введите температурув градусах цельсия")
alert(9 / 5 * +celsiusTerm + 32)

/*2. Работа с переменными.Объявить две переменные: admin и name.Записать в name строку "Василий";
Скопировать значение из name в admin.Вывести admin(должно вывести «Василий»).*/

let admin
let name
nameMy = "Василий"
admin = nameMy
console.log(admin)


/*3. * Чему будет равно JS - выражение 1000 + "108"*/

"10001008", тип "string";

/*4. * Самостоятельно разобраться с атрибутами тега script(async и defer)*/
вроде да.